### Today Topics
- **Pandas**
    - one of most important data science module in python
    - data analysis, manipulation and cleaning
    - pandas means PanelData
        - data existed in the form of rows and columns(in tabular format)
    - 2 data structures in pandas
        - 1)Series and 
        - 2)DataFrame
    - **Series**
        - Data is in sequential order (line by line)
        - Data in data frame:frame having some boarder
        
    - pip install pandas
    - import pandas as pd
    
    - Ex:Your college data

### Conversion of all data types and structures into series
- str and tuple,list,set to be converted into series
- **syntax**
    - pd.Series(ele)

In [15]:
st="Hi I am Ruthu from APSSDC" # single str
pd.Series(st)

0    Hi I am Ruthu from APSSDC
dtype: object

In [17]:
st2="Hi I am Ruthu from APSSDC".split() # str
s=pd.Series(st2) # series
print(s) # printing the series

0        Hi
1         I
2        am
3     Ruthu
4      from
5    APSSDC
dtype: object

In [17]:
st2="Hi I am Ruthu from APSSDC".split() # str
s=pd.Series(st2) # series
print(s) # printing the series

0        Hi
1         I
2        am
3     Ruthu
4      from
5    APSSDC
dtype: object

In [19]:
# conversion of tuple to series by providing user index
t=(9,'andhra loyola',90.45,"python")
pd.Series(t,index=("Int",'str',"float",'lang'))

Int                  9
str      andhra loyola
float            90.45
lang            python
dtype: object

In [20]:
# 2d :key:val
dic={'key':'hi',"clg":"Andhra Loyola",90:123}
pd.Series(dic) # keys as indices

key               hi
clg    Andhra Loyola
90               123
dtype: object

In [21]:
# 2d :key:val
dic={'key':'hi',"clg":"Andhra Loyola",90:123} # user declaration
pd.Series(dic,index=['first','second','third']) # indices modified here

first     NaN
second    NaN
third     NaN
dtype: object

In [23]:
# converting range() into series
rn=range(50,56) # 10 values
pd.Series(rn,index=['fifty','fifty one','fifty two','fifty three','fifty four','fifty five'])

fifty          50
fifty one      51
fifty two      52
fifty three    53
fifty four     54
fifty five     55
dtype: int64

In [24]:
# array into series
import numpy as np
ar=np.array([9,4,5,6])
pd.Series(ar,index=("IX","IV",'V','VI'))

IX    9
IV    4
V     5
VI    6
dtype: int32

In [28]:
a=np.arange(20,60,4)
s=pd.Series(a,index=[num for num in range(1,11)])
print(s)
for order in s:
    print(order)

1     20
2     24
3     28
4     32
5     36
6     40
7     44
8     48
9     52
10    56
dtype: int32
20
24
28
32
36
40
44
48
52
56

#### Data Frames
- data in the form of rows and columns

In [29]:
# conversion of all

In [31]:
st="I am python trainer at APSSDC".split()
pd.DataFrame(st)

         0
0        I
1       am
2   python
3  trainer
4       at
5   APSSDC

In [32]:
st="I am python trainer at APSSDC"
pd.DataFrame(st)

ValueError: DataFrame constructor not properly called!

In [48]:
# convert the array into data frame
ar2=np.arange(50,55) # array;row matrix
pd.DataFrame(ar2,index=[range(1,6)])

ValueError: Shape of passed values is (5, 1), indices imply (1, 1)

In [50]:
li=[[1,2,3],[4,5,6]] # list of lists [[],[]],list1','list2'])
pd.DataFrame(li,index=["list1","list2"])

       0  1  2
list1  1  2  3
list2  4  5  6

In [51]:
dic={"key":'value','course':"data science",'progam':"online training",'date':"14 07 2021"}
dic

{'key': 'value',
 'course': 'data science',
 'progam': 'online training',
 'date': '14 07 2021'}

In [55]:
pd.DataFrame(dic,index=[1,2,3,4])

     key        course           progam        date
1  value  data science  online training  14 07 2021
2  value  data science  online training  14 07 2021
3  value  data science  online training  14 07 2021
4  value  data science  online training  14 07 2021

In [56]:
dic2={'Names':["Ruthu",'Vanitha','Nandini'],"ID":('N130001','N130002','N130003'),'Marks':[20,80,90]}
pd.DataFrame(dic2)

     Names       ID  Marks
0    Ruthu  N130001     20
1  Vanitha  N130002     80
2  Nandini  N130003     90

In [57]:
# Create the following data frame
''' Integer Float String 
     -       -     -
     -       -     -
     -       -     -
     -       -     - '''

' Integer Float String \n     -       -     -\n     -       -     -\n     -       -     -\n     -       -     - '

In [61]:
dic3={'Integer':[2,3,4,5],'Float':(2.0,3.0,4.0,5.0),'String':["Two","Three","Four","Five"]}
pd.DataFrame(dic3,index=["row1",'row2','row3','row4'])

      Integer  Float String
row1        2    2.0    Two
row2        3    3.0  Three
row3        4    4.0   Four
row4        5    5.0   Five

In [62]:
### Data Manipulation
# join,merge and concatenate 2 data frames

In [63]:
import pandas as pd
df1=pd.DataFrame({"Int_rate":[2,1,2,3],
                  "Int_gdp":[50,45,45,67]},
                 index=[2041,2002,2003,2204])
df1

      Int_rate  Int_gdp
2041         2       50
2002         1       45
2003         2       45
2204         3       67

In [64]:
df2=pd.DataFrame({"low_tier_hpi":[80,90,70,60],
                  "unemployment":[1,3,5,6]},
                 index=[2001,2003,2002,2005])
df2

      low_tier_hpi  unemployment
2001            80             1
2003            90             3
2002            70             5
2005            60             6

In [65]:
df1.join(df2) # by the side of df1
# extension of columns in existed data frame

      Int_rate  Int_gdp  low_tier_hpi  unemployment
2041         2       50           NaN           NaN
2002         1       45          70.0           5.0
2003         2       45          90.0           3.0
2204         3       67           NaN           NaN

In [66]:
df1.merge(df2) # common values

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [69]:
df3=pd.DataFrame({"a":[80,90,60,70],
                  "b":[2,1,2,3],
                  "c":[50,45,45,67]}, 
                 index=[2001,2002,2003,2004])
df3

       a  b   c
2001  80  2  50
2002  90  1  45
2003  60  2  45
2004  70  3  67

In [73]:
df4=pd.DataFrame({"a":[80,69,60,70],
                  "b":[2,1,2,3],
                  "c":[50,45,45,67]},
                 index=[2001,2005,2006,2008])
df4

       a  b   c
2001  80  2  50
2005  69  1  45
2006  60  2  45
2008  70  3  67

In [75]:
df5=df3.merge(df4) # merged 
df5.index=[2001,2002,2003]

In [77]:
df5

       a  b   c
2001  80  2  50
2002  60  2  45
2003  70  3  67

In [81]:
pd.concat([df3,df4])

       a  b   c
2001  80  2  50
2002  90  1  45
2003  60  2  45
2004  70  3  67
2001  80  2  50
2005  69  1  45
2006  60  2  45
2008  70  3  67

In [83]:
df3.merge(df4,on="b") # merging based upon perticular column

   a_x  b  c_x  a_y  c_y
0   80  2   50   80   50
1   80  2   50   60   45
2   60  2   45   80   50
3   60  2   45   60   45
4   90  1   45   69   45
5   70  3   67   70   67

In [84]:
df3

       a  b   c
2001  80  2  50
2002  90  1  45
2003  60  2  45
2004  70  3  67

In [85]:
dates=pd.date_range('2021-07-14','2021-07-20') # used to get dates:y m d
pd.Series(dates,index=['Day1','Day2','Day3','Day4','Day5','Day6','Day7'])

Day1   2021-07-14
Day2   2021-07-15
Day3   2021-07-16
Day4   2021-07-17
Day5   2021-07-18
Day6   2021-07-19
Day7   2021-07-20
dtype: datetime64[ns]

In [86]:
dates=pd.date_range('2021-07-14',periods=10) # used to get dates:y m d
pd.Series(dates)

0   2021-07-14
1   2021-07-15
2   2021-07-16
3   2021-07-17
4   2021-07-18
5   2021-07-19
6   2021-07-20
7   2021-07-21
8   2021-07-22
9   2021-07-23
dtype: datetime64[ns]

### Working with .csv file
- reading the file
- analysis
- manipulation
- cleaning

In [88]:
data=pd.read_csv("marks.csv")
data

      Name  DBMS   R  DAA  JAVA
0    Ashok    94  93   95    98
1    Bhanu    81  98   85    98
2   Chandu    84  99   80    80
3  Dhanush    81  96   98    86
4   Elisha    91  98   85    86
5  Fathima    99  95   86   100
6   Harish    95  84   88    98
7  Jahnavi    88  81   87    86
8   Kamala    97  98   99    96
9  Lakshmi    83  95   80    93

In [90]:
data['Name'] # accessing perticular column values

0      Ashok
1      Bhanu
2     Chandu
3    Dhanush
4     Elisha
5    Fathima
6     Harish
7    Jahnavi
8     Kamala
9    Lakshmi
Name: Name, dtype: object

In [92]:
data[:5] # getting first indexed rows

      Name  DBMS   R  DAA  JAVA
0    Ashok    94  93   95    98
1    Bhanu    81  98   85    98
2   Chandu    84  99   80    80
3  Dhanush    81  96   98    86
4   Elisha    91  98   85    86

In [93]:
data[::-1] # reversing the order of data frame

      Name  DBMS   R  DAA  JAVA
9  Lakshmi    83  95   80    93
8   Kamala    97  98   99    96
7  Jahnavi    88  81   87    86
6   Harish    95  84   88    98
5  Fathima    99  95   86   100
4   Elisha    91  98   85    86
3  Dhanush    81  96   98    86
2   Chandu    84  99   80    80
1    Bhanu    81  98   85    98
0    Ashok    94  93   95    98

In [94]:
data[::2]

     Name  DBMS   R  DAA  JAVA
0   Ashok    94  93   95    98
2  Chandu    84  99   80    80
4  Elisha    91  98   85    86
6  Harish    95  84   88    98
8  Kamala    97  98   99    96

In [96]:
# first five rows of sample
data.head() # 5 rows

      Name  DBMS   R  DAA  JAVA
0    Ashok    94  93   95    98
1    Bhanu    81  98   85    98
2   Chandu    84  99   80    80
3  Dhanush    81  96   98    86
4   Elisha    91  98   85    86

In [97]:
data.head(3) # indexed many rows

     Name  DBMS   R  DAA  JAVA
0   Ashok    94  93   95    98
1   Bhanu    81  98   85    98
2  Chandu    84  99   80    80

In [99]:
data.tail() # last five rows

      Name  DBMS   R  DAA  JAVA
5  Fathima    99  95   86   100
6   Harish    95  84   88    98
7  Jahnavi    88  81   87    86
8   Kamala    97  98   99    96
9  Lakshmi    83  95   80    93

In [100]:
data.tail(3) # last 3 rows

      Name  DBMS   R  DAA  JAVA
7  Jahnavi    88  81   87    86
8   Kamala    97  98   99    96
9  Lakshmi    83  95   80    93

In [104]:
usecols=['N','D','R','J']

In [103]:
data.columns # list of column values

Index(['Name', 'DBMS', 'R', 'DAA', 'JAVA'], dtype='object')

In [108]:
pd.read_csv("marks.csv",usecols=["Name","DBMS"]) # getting the perticular columns

      Name  DBMS
0    Ashok    94
1    Bhanu    81
2   Chandu    84
3  Dhanush    81
4   Elisha    91
5  Fathima    99
6   Harish    95
7  Jahnavi    88
8   Kamala    97
9  Lakshmi    83

In [109]:
df=pd.read_csv("marks.csv",header=None)  # header is removed
df

          0     1   2    3     4
0      Name  DBMS   R  DAA  JAVA
1     Ashok    94  93   95    98
2     Bhanu    81  98   85    98
3    Chandu    84  99   80    80
4   Dhanush    81  96   98    86
5    Elisha    91  98   85    86
6   Fathima    99  95   86   100
7    Harish    95  84   88    98
8   Jahnavi    88  81   87    86
9    Kamala    97  98   99    96
10  Lakshmi    83  95   80    93

In [110]:
df2=pd.read_csv("marks.csv",names=['N','D','R','DAA','J'])  # header is removed
df2

          N     D   R  DAA     J
0      Name  DBMS   R  DAA  JAVA
1     Ashok    94  93   95    98
2     Bhanu    81  98   85    98
3    Chandu    84  99   80    80
4   Dhanush    81  96   98    86
5    Elisha    91  98   85    86
6   Fathima    99  95   86   100
7    Harish    95  84   88    98
8   Jahnavi    88  81   87    86
9    Kamala    97  98   99    96
10  Lakshmi    83  95   80    93

In [112]:
df2[['N','DAA']] # accessing the corresponding column values

          N  DAA
0      Name  DAA
1     Ashok   95
2     Bhanu   85
3    Chandu   80
4   Dhanush   98
5    Elisha   85
6   Fathima   86
7    Harish   88
8   Jahnavi   87
9    Kamala   99
10  Lakshmi   80

In [114]:
df2.info # textual information

<bound method DataFrame.info of           N     D   R  DAA     J
0      Name  DBMS   R  DAA  JAVA
1     Ashok    94  93   95    98
2     Bhanu    81  98   85    98
3    Chandu    84  99   80    80
4   Dhanush    81  96   98    86
5    Elisha    91  98   85    86
6   Fathima    99  95   86   100
7    Harish    95  84   88    98
8   Jahnavi    88  81   87    86
9    Kamala    97  98   99    96
10  Lakshmi    83  95   80    93>

In [116]:
df2.describe() # statistics of data

              N   D   R DAA   J
count        11  11  11  11  11
unique       11  10   8   9   7
top     Fathima  81  98  80  98
freq          1   2   3   2   3

In [117]:
frequency- no.of occurences

SyntaxError: invalid syntax (<ipython-input-117-dbab52dfe83b>, line 1)

In [118]:
df2.isnull() # boolean df

        N      D      R    DAA      J
0   False  False  False  False  False
1   False  False  False  False  False
2   False  False  False  False  False
3   False  False  False  False  False
4   False  False  False  False  False
5   False  False  False  False  False
6   False  False  False  False  False
7   False  False  False  False  False
8   False  False  False  False  False
9   False  False  False  False  False
10  False  False  False  False  False

In [125]:
new=pd.read_csv("marks.csv")
new.isnull() # converted into list of values

    Name   DBMS      R    DAA   JAVA
0  False  False  False  False  False
1  False  False  False  False  False
2  False  False  False  False  False
3  False   True  False  False  False
4  False  False  False  False  False
5  False  False  False  False  False
6  False  False  False   True  False
7  False  False  False  False  False
8  False  False  False  False  False
9  False  False  False   True  False

In [126]:
new.dropna() # NaN will be removed

      Name   DBMS   R    DAA  JAVA
0    Ashok   87.0  86   82.0    90
1    Bhanu   95.0  86  100.0    80
2   Chandu  100.0  82   85.0    82
4   Elisha   88.0  87   82.0    87
5  Fathima   93.0  90   90.0    94
7  Jahnavi   92.0  87   90.0    98
8   Kamala   88.0  90   94.0   100